---
title: AnalysisDisplayColorEntry
classe: Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# AnalysisDisplayColorEntry

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color Color { get; }` | `analysisDisplayColorEntry.Color` | Color |
| `Boolean IsValidObject { get; }` | `analysisDisplayColorEntry.IsValidObject` | Boolean |
| `Double Value { get; }` | `analysisDisplayColorEntry.Value` | Double |
| `Void Dispose()` | `analysisDisplayColorEntry.Dispose()` | Void |
| `Boolean HasValue()` | `analysisDisplayColorEntry.HasValue()` | Boolean |
| `Boolean IsEqual(AnalysisDisplayColorEntry)` | `analysisDisplayColorEntry.IsEqual(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```